Microchip-MPLAB-Harmony/ethercat/apps/ethercat_counter_foe_app/firmware/src/packs/ATSAME53J20A_DFP/component/sdhc.h
#define SDHC_PSR_CMDINHC_Pos                  _U_(0)                                               /**< (SDHC_PSR) Command Inhibit (CMD) Position */
#define SDHC_PSR_CMDINHC_Msk                  (_U_(0x1) << SDHC_PSR_CMDINHC_Pos)                   /**< (SDHC_PSR) Command Inhibit (CMD) Mask */
#define SDHC_PSR_CMDINHC(value)               (SDHC_PSR_CMDINHC_Msk & ((value) << SDHC_PSR_CMDINHC_Pos))
#define   SDHC_PSR_CMDINHC_CAN_Val            _U_(0x0)                                             /**< (SDHC_PSR) Can issue command using only CMD line  */
#define   SDHC_PSR_CMDINHC_CANNOT_Val         _U_(0x1)                                             /**< (SDHC_PSR) Cannot issue command  */
#define SDHC_PSR_CMDINHC_CAN                  (SDHC_PSR_CMDINHC_CAN_Val << SDHC_PSR_CMDINHC_Pos)   /**< (SDHC_PSR) Can issue command using only CMD line Position  */
#define SDHC_PSR_CMDINHC_CANNOT               (SDHC_PSR_CMDINHC_CANNOT_Val << SDHC_PSR_CMDINHC_Pos) /**< (SDHC_PSR) Cannot issue command Position  */
#define SDHC_PSR_CMDINHD_Pos                  _U_(1)                                               /**< (SDHC_PSR) Command Inhibit (DAT) Position */
#define SDHC_PSR_CMDINHD_Msk                  (_U_(0x1) << SDHC_PSR_CMDINHD_Pos)                   /**< (SDHC_PSR) Command Inhibit (DAT) Mask */
#define SDHC_PSR_CMDINHD(value)               (SDHC_PSR_CMDINHD_Msk & ((value) << SDHC_PSR_CMDINHD_Pos))
#define   SDHC_PSR_CMDINHD_CAN_Val            _U_(0x0)                                             /**< (SDHC_PSR) Can issue command which uses the DAT line  */
#define   SDHC_PSR_CMDINHD_CANNOT_Val         _U_(0x1)                                             /**< (SDHC_PSR) Cannot issue command which uses the DAT line  */
#define SDHC_PSR_CMDINHD_CAN                  (SDHC_PSR_CMDINHD_CAN_Val << SDHC_PSR_CMDINHD_Pos)   /**< (SDHC_PSR) Can issue command which uses the DAT line Position  */
#define SDHC_PSR_CMDINHD_CANNOT               (SDHC_PSR_CMDINHD_CANNOT_Val << SDHC_PSR_CMDINHD_Pos) /**< (SDHC_PSR) Cannot issue command which uses the DAT line Position  */
#define SDHC_PSR_DLACT_Pos                    _U_(2)                                               /**< (SDHC_PSR) DAT Line Active Position */
#define SDHC_PSR_DLACT_Msk                    (_U_(0x1) << SDHC_PSR_DLACT_Pos)                     /**< (SDHC_PSR) DAT Line Active Mask */
#define SDHC_PSR_DLACT(value)                 (SDHC_PSR_DLACT_Msk & ((value) << SDHC_PSR_DLACT_Pos))
#define   SDHC_PSR_DLACT_INACTIVE_Val         _U_(0x0)                                             /**< (SDHC_PSR) DAT Line Inactive  */
#define   SDHC_PSR_DLACT_ACTIVE_Val           _U_(0x1)                                             /**< (SDHC_PSR) DAT Line Active  */
#define SDHC_PSR_DLACT_INACTIVE               (SDHC_PSR_DLACT_INACTIVE_Val << SDHC_PSR_DLACT_Pos)  /**< (SDHC_PSR) DAT Line Inactive Position  */
#define SDHC_PSR_DLACT_ACTIVE                 (SDHC_PSR_DLACT_ACTIVE_Val << SDHC_PSR_DLACT_Pos)    /**< (SDHC_PSR) DAT Line Active Position  */
#define SDHC_PSR_RTREQ_Pos                    _U_(3)                                               /**< (SDHC_PSR) Re-Tuning Request Position */
#define SDHC_PSR_RTREQ_Msk                    (_U_(0x1) << SDHC_PSR_RTREQ_Pos)                     /**< (SDHC_PSR) Re-Tuning Request Mask */
#define SDHC_PSR_RTREQ(value)                 (SDHC_PSR_RTREQ_Msk & ((value) << SDHC_PSR_RTREQ_Pos))
#define   SDHC_PSR_RTREQ_OK_Val               _U_(0x0)                                             /**< (SDHC_PSR) Fixed or well-tuned sampling clock  */
#define   SDHC_PSR_RTREQ_REQUIRED_Val         _U_(0x1)                                             /**< (SDHC_PSR) Sampling clock needs re-tuning  */
#define SDHC_PSR_RTREQ_OK                     (SDHC_PSR_RTREQ_OK_Val << SDHC_PSR_RTREQ_Pos)        /**< (SDHC_PSR) Fixed or well-tuned sampling clock Position  */
#define SDHC_PSR_RTREQ_REQUIRED               (SDHC_PSR_RTREQ_REQUIRED_Val << SDHC_PSR_RTREQ_Pos)  /**< (SDHC_PSR) Sampling clock needs re-tuning Position  */
#define SDHC_PSR_WTACT_Pos                    _U_(8)                                               /**< (SDHC_PSR) Write Transfer Active Position */
#define SDHC_PSR_WTACT_Msk                    (_U_(0x1) << SDHC_PSR_WTACT_Pos)                     /**< (SDHC_PSR) Write Transfer Active Mask */
#define SDHC_PSR_WTACT(value)                 (SDHC_PSR_WTACT_Msk & ((value) << SDHC_PSR_WTACT_Pos))
#define   SDHC_PSR_WTACT_NO_Val               _U_(0x0)                                             /**< (SDHC_PSR) No valid data  */
#define   SDHC_PSR_WTACT_YES_Val              _U_(0x1)                                             /**< (SDHC_PSR) Transferring data  */
#define SDHC_PSR_WTACT_NO                     (SDHC_PSR_WTACT_NO_Val << SDHC_PSR_WTACT_Pos)        /**< (SDHC_PSR) No valid data Position  */
#define SDHC_PSR_WTACT_YES                    (SDHC_PSR_WTACT_YES_Val << SDHC_PSR_WTACT_Pos)       /**< (SDHC_PSR) Transferring data Position  */
#define SDHC_PSR_RTACT_Pos                    _U_(9)                                               /**< (SDHC_PSR) Read Transfer Active Position */
#define SDHC_PSR_RTACT_Msk                    (_U_(0x1) << SDHC_PSR_RTACT_Pos)                     /**< (SDHC_PSR) Read Transfer Active Mask */
#define SDHC_PSR_RTACT(value)                 (SDHC_PSR_RTACT_Msk & ((value) << SDHC_PSR_RTACT_Pos))
#define   SDHC_PSR_RTACT_NO_Val               _U_(0x0)                                             /**< (SDHC_PSR) No valid data  */
#define   SDHC_PSR_RTACT_YES_Val              _U_(0x1)                                             /**< (SDHC_PSR) Transferring data  */
#define SDHC_PSR_RTACT_NO                     (SDHC_PSR_RTACT_NO_Val << SDHC_PSR_RTACT_Pos)        /**< (SDHC_PSR) No valid data Position  */
#define SDHC_PSR_RTACT_YES                    (SDHC_PSR_RTACT_YES_Val << SDHC_PSR_RTACT_Pos)       /**< (SDHC_PSR) Transferring data Position  */
#define SDHC_PSR_BUFWREN_Pos                  _U_(10)                                              /**< (SDHC_PSR) Buffer Write Enable Position */
#define SDHC_PSR_BUFWREN_Msk                  (_U_(0x1) << SDHC_PSR_BUFWREN_Pos)                   /**< (SDHC_PSR) Buffer Write Enable Mask */
#define SDHC_PSR_BUFWREN(value)               (SDHC_PSR_BUFWREN_Msk & ((value) << SDHC_PSR_BUFWREN_Pos))
#define   SDHC_PSR_BUFWREN_DISABLE_Val        _U_(0x0)                                             /**< (SDHC_PSR) Write disable  */
#define   SDHC_PSR_BUFWREN_ENABLE_Val         _U_(0x1)                                             /**< (SDHC_PSR) Write enable  */
#define SDHC_PSR_BUFWREN_DISABLE              (SDHC_PSR_BUFWREN_DISABLE_Val << SDHC_PSR_BUFWREN_Pos) /**< (SDHC_PSR) Write disable Position  */
#define SDHC_PSR_BUFWREN_ENABLE               (SDHC_PSR_BUFWREN_ENABLE_Val << SDHC_PSR_BUFWREN_Pos) /**< (SDHC_PSR) Write enable Position  */
#define SDHC_PSR_BUFRDEN_Pos                  _U_(11)                                              /**< (SDHC_PSR) Buffer Read Enable Position */
#define SDHC_PSR_BUFRDEN_Msk                  (_U_(0x1) << SDHC_PSR_BUFRDEN_Pos)                   /**< (SDHC_PSR) Buffer Read Enable Mask */
#define SDHC_PSR_BUFRDEN(value)               (SDHC_PSR_BUFRDEN_Msk & ((value) << SDHC_PSR_BUFRDEN_Pos))
#define   SDHC_PSR_BUFRDEN_DISABLE_Val        _U_(0x0)                                             /**< (SDHC_PSR) Read disable  */
#define   SDHC_PSR_BUFRDEN_ENABLE_Val         _U_(0x1)                                             /**< (SDHC_PSR) Read enable  */
#define SDHC_PSR_BUFRDEN_DISABLE              (SDHC_PSR_BUFRDEN_DISABLE_Val << SDHC_PSR_BUFRDEN_Pos) /**< (SDHC_PSR) Read disable Position  */
#define SDHC_PSR_BUFRDEN_ENABLE               (SDHC_PSR_BUFRDEN_ENABLE_Val << SDHC_PSR_BUFRDEN_Pos) /**< (SDHC_PSR) Read enable Position  */
#define SDHC_PSR_CARDINS_Pos                  _U_(16)                                              /**< (SDHC_PSR) Card Inserted Position */
#define SDHC_PSR_CARDINS_Msk                  (_U_(0x1) << SDHC_PSR_CARDINS_Pos)                   /**< (SDHC_PSR) Card Inserted Mask */
#define SDHC_PSR_CARDINS(value)               (SDHC_PSR_CARDINS_Msk & ((value) << SDHC_PSR_CARDINS_Pos))
#define   SDHC_PSR_CARDINS_NO_Val             _U_(0x0)                                             /**< (SDHC_PSR) Reset or Debouncing or No Card  */
#define   SDHC_PSR_CARDINS_YES_Val            _U_(0x1)                                             /**< (SDHC_PSR) Card inserted  */
#define SDHC_PSR_CARDINS_NO                   (SDHC_PSR_CARDINS_NO_Val << SDHC_PSR_CARDINS_Pos)    /**< (SDHC_PSR) Reset or Debouncing or No Card Position  */
#define SDHC_PSR_CARDINS_YES                  (SDHC_PSR_CARDINS_YES_Val << SDHC_PSR_CARDINS_Pos)   /**< (SDHC_PSR) Card inserted Position  */
#define SDHC_PSR_CARDSS_Pos                   _U_(17)                                              /**< (SDHC_PSR) Card State Stable Position */
#define SDHC_PSR_CARDSS_Msk                   (_U_(0x1) << SDHC_PSR_CARDSS_Pos)                    /**< (SDHC_PSR) Card State Stable Mask */
#define SDHC_PSR_CARDSS(value)                (SDHC_PSR_CARDSS_Msk & ((value) << SDHC_PSR_CARDSS_Pos))
#define   SDHC_PSR_CARDSS_NO_Val              _U_(0x0)                                             /**< (SDHC_PSR) Reset or Debouncing  */
#define   SDHC_PSR_CARDSS_YES_Val             _U_(0x1)                                             /**< (SDHC_PSR) No Card or Insered  */
#define SDHC_PSR_CARDSS_NO                    (SDHC_PSR_CARDSS_NO_Val << SDHC_PSR_CARDSS_Pos)      /**< (SDHC_PSR) Reset or Debouncing Position  */
#define SDHC_PSR_CARDSS_YES                   (SDHC_PSR_CARDSS_YES_Val << SDHC_PSR_CARDSS_Pos)     /**< (SDHC_PSR) No Card or Insered Position  */
#define SDHC_PSR_CARDDPL_Pos                  _U_(18)                                              /**< (SDHC_PSR) Card Detect Pin Level Position */
#define SDHC_PSR_CARDDPL_Msk                  (_U_(0x1) << SDHC_PSR_CARDDPL_Pos)                   /**< (SDHC_PSR) Card Detect Pin Level Mask */
#define SDHC_PSR_CARDDPL(value)               (SDHC_PSR_CARDDPL_Msk & ((value) << SDHC_PSR_CARDDPL_Pos))
#define   SDHC_PSR_CARDDPL_NO_Val             _U_(0x0)                                             /**< (SDHC_PSR) No card present (SDCD#=1)  */
#define   SDHC_PSR_CARDDPL_YES_Val            _U_(0x1)                                             /**< (SDHC_PSR) Card present (SDCD#=0)  */
#define SDHC_PSR_CARDDPL_NO                   (SDHC_PSR_CARDDPL_NO_Val << SDHC_PSR_CARDDPL_Pos)    /**< (SDHC_PSR) No card present (SDCD#=1) Position  */
#define SDHC_PSR_CARDDPL_YES                  (SDHC_PSR_CARDDPL_YES_Val << SDHC_PSR_CARDDPL_Pos)   /**< (SDHC_PSR) Card present (SDCD#=0) Position  */
#define SDHC_PSR_WRPPL_Pos                    _U_(19)                                              /**< (SDHC_PSR) Write Protect Pin Level Position */
#define SDHC_PSR_WRPPL_Msk                    (_U_(0x1) << SDHC_PSR_WRPPL_Pos)                     /**< (SDHC_PSR) Write Protect Pin Level Mask */
#define SDHC_PSR_WRPPL(value)                 (SDHC_PSR_WRPPL_Msk & ((value) << SDHC_PSR_WRPPL_Pos))
#define   SDHC_PSR_WRPPL_PROTECTED_Val        _U_(0x0)                                             /**< (SDHC_PSR) Write protected (SDWP#=0)  */
#define   SDHC_PSR_WRPPL_ENABLED_Val          _U_(0x1)                                             /**< (SDHC_PSR) Write enabled (SDWP#=1)  */
#define SDHC_PSR_WRPPL_PROTECTED              (SDHC_PSR_WRPPL_PROTECTED_Val << SDHC_PSR_WRPPL_Pos) /**< (SDHC_PSR) Write protected (SDWP#=0) Position  */
#define SDHC_PSR_WRPPL_ENABLED                (SDHC_PSR_WRPPL_ENABLED_Val << SDHC_PSR_WRPPL_Pos)   /**< (SDHC_PSR) Write enabled (SDWP#=1) Position  */
#define SDHC_PSR_DATLL_Pos                    _U_(20)                                              /**< (SDHC_PSR) DAT[3:0] Line Level Position */
#define SDHC_PSR_DATLL_Msk                    (_U_(0xF) << SDHC_PSR_DATLL_Pos)                     /**< (SDHC_PSR) DAT[3:0] Line Level Mask */
#define SDHC_PSR_DATLL(value)                 (SDHC_PSR_DATLL_Msk & ((value) << SDHC_PSR_DATLL_Pos))
#define SDHC_PSR_CMDLL_Pos                    _U_(24)                                              /**< (SDHC_PSR) CMD Line Level Position */
#define SDHC_PSR_CMDLL_Msk                    (_U_(0x1) << SDHC_PSR_CMDLL_Pos)                     /**< (SDHC_PSR) CMD Line Level Mask */
#define SDHC_PSR_CMDLL(value)                 (SDHC_PSR_CMDLL_Msk & ((value) << SDHC_PSR_CMDLL_Pos))
#define SDHC_PSR_Msk                          _U_(0x01FF0F0F)                                      /**< (SDHC_PSR) Register Mask  */


/* -------- SDHC_HC1R : (SDHC Offset: 0x28) (R/W 8) Host Control 1 -------- */
#define SDHC_HC1R_RESETVALUE                  _U_(0xE00)                                           /**<  (SDHC_HC1R) Host Control 1  Reset Value */

#define SDHC_HC1R_LEDCTRL_Pos                 _U_(0)                                               /**< (SDHC_HC1R) LED Control Position */
#define SDHC_HC1R_LEDCTRL_Msk                 (_U_(0x1) << SDHC_HC1R_LEDCTRL_Pos)                  /**< (SDHC_HC1R) LED Control Mask */
#define SDHC_HC1R_LEDCTRL(value)              (SDHC_HC1R_LEDCTRL_Msk & ((value) << SDHC_HC1R_LEDCTRL_Pos))
#define   SDHC_HC1R_LEDCTRL_OFF_Val           _U_(0x0)                                             /**< (SDHC_HC1R) LED off  */
#define   SDHC_HC1R_LEDCTRL_ON_Val            _U_(0x1)                                             /**< (SDHC_HC1R) LED on  */
#define SDHC_HC1R_LEDCTRL_OFF                 (SDHC_HC1R_LEDCTRL_OFF_Val << SDHC_HC1R_LEDCTRL_Pos) /**< (SDHC_HC1R) LED off Position  */
#define SDHC_HC1R_LEDCTRL_ON                  (SDHC_HC1R_LEDCTRL_ON_Val << SDHC_HC1R_LEDCTRL_Pos)  /**< (SDHC_HC1R) LED on Position  */
#define SDHC_HC1R_DW_Pos                      _U_(1)                                               /**< (SDHC_HC1R) Data Width Position */
#define SDHC_HC1R_DW_Msk                      (_U_(0x1) << SDHC_HC1R_DW_Pos)                       /**< (SDHC_HC1R) Data Width Mask */
#define SDHC_HC1R_DW(value)                   (SDHC_HC1R_DW_Msk & ((value) << SDHC_HC1R_DW_Pos))  
#define   SDHC_HC1R_DW_1BIT_Val               _U_(0x0)                                             /**< (SDHC_HC1R) 1-bit mode  */
#define   SDHC_HC1R_DW_4BIT_Val               _U_(0x1)                                             /**< (SDHC_HC1R) 4-bit mode  */
#define SDHC_HC1R_DW_1BIT                     (SDHC_HC1R_DW_1BIT_Val << SDHC_HC1R_DW_Pos)          /**< (SDHC_HC1R) 1-bit mode Position  */
#define SDHC_HC1R_DW_4BIT                     (SDHC_HC1R_DW_4BIT_Val << SDHC_HC1R_DW_Pos)          /**< (SDHC_HC1R) 4-bit mode Position  */
#define SDHC_HC1R_HSEN_Pos                    _U_(2)                                               /**< (SDHC_HC1R) High Speed Enable Position */
#define SDHC_HC1R_HSEN_Msk                    (_U_(0x1) << SDHC_HC1R_HSEN_Pos)                     /**< (SDHC_HC1R) High Speed Enable Mask */
#define SDHC_HC1R_HSEN(value)                 (SDHC_HC1R_HSEN_Msk & ((value) << SDHC_HC1R_HSEN_Pos))
#define   SDHC_HC1R_HSEN_NORMAL_Val           _U_(0x0)                                             /**< (SDHC_HC1R) Normal Speed mode  */
#define   SDHC_HC1R_HSEN_HIGH_Val             _U_(0x1)                                             /**< (SDHC_HC1R) High Speed mode  */
#define SDHC_HC1R_HSEN_NORMAL                 (SDHC_HC1R_HSEN_NORMAL_Val << SDHC_HC1R_HSEN_Pos)    /**< (SDHC_HC1R) Normal Speed mode Position  */
#define SDHC_HC1R_HSEN_HIGH                   (SDHC_HC1R_HSEN_HIGH_Val << SDHC_HC1R_HSEN_Pos)      /**< (SDHC_HC1R) High Speed mode Position  */
#define SDHC_HC1R_DMASEL_Pos                  _U_(3)                                               /**< (SDHC_HC1R) DMA Select Position */
#define SDHC_HC1R_DMASEL_Msk                  (_U_(0x3) << SDHC_HC1R_DMASEL_Pos)                   /**< (SDHC_HC1R) DMA Select Mask */
#define SDHC_HC1R_DMASEL(value)               (SDHC_HC1R_DMASEL_Msk & ((value) << SDHC_HC1R_DMASEL_Pos))
#define   SDHC_HC1R_DMASEL_SDMA_Val           _U_(0x0)                                             /**< (SDHC_HC1R) SDMA is selected  */
#define   SDHC_HC1R_DMASEL_32BIT_Val          _U_(0x2)                                             /**< (SDHC_HC1R) 32-bit Address ADMA2 is selected  */
#define SDHC_HC1R_DMASEL_SDMA                 (SDHC_HC1R_DMASEL_SDMA_Val << SDHC_HC1R_DMASEL_Pos)  /**< (SDHC_HC1R) SDMA is selected Position  */
#define SDHC_HC1R_DMASEL_32BIT                (SDHC_HC1R_DMASEL_32BIT_Val << SDHC_HC1R_DMASEL_Pos) /**< (SDHC_HC1R) 32-bit Address ADMA2 is selected Position  */
#define SDHC_HC1R_CARDDTL_Pos                 _U_(6)                                               /**< (SDHC_HC1R) Card Detect Test Level Position */
#define SDHC_HC1R_CARDDTL_Msk                 (_U_(0x1) << SDHC_HC1R_CARDDTL_Pos)                  /**< (SDHC_HC1R) Card Detect Test Level Mask */
#define SDHC_HC1R_CARDDTL(value)              (SDHC_HC1R_CARDDTL_Msk & ((value) << SDHC_HC1R_CARDDTL_Pos))
#define   SDHC_HC1R_CARDDTL_NO_Val            _U_(0x0)                                             /**< (SDHC_HC1R) No Card  */
#define   SDHC_HC1R_CARDDTL_YES_Val           _U_(0x1)                                             /**< (SDHC_HC1R) Card Inserted  */
#define SDHC_HC1R_CARDDTL_NO                  (SDHC_HC1R_CARDDTL_NO_Val << SDHC_HC1R_CARDDTL_Pos)  /**< (SDHC_HC1R) No Card Position  */
#define SDHC_HC1R_CARDDTL_YES                 (SDHC_HC1R_CARDDTL_YES_Val << SDHC_HC1R_CARDDTL_Pos) /**< (SDHC_HC1R) Card Inserted Position  */
#define SDHC_HC1R_CARDDSEL_Pos                _U_(7)                                               /**< (SDHC_HC1R) Card Detect Signal Selection Position */
#define SDHC_HC1R_CARDDSEL_Msk                (_U_(0x1) << SDHC_HC1R_CARDDSEL_Pos)                 /**< (SDHC_HC1R) Card Detect Signal Selection Mask */
#define SDHC_HC1R_CARDDSEL(value)             (SDHC_HC1R_CARDDSEL_Msk & ((value) << SDHC_HC1R_CARDDSEL_Pos))
#define   SDHC_HC1R_CARDDSEL_NORMAL_Val       _U_(0x0)                                             /**< (SDHC_HC1R) SDCD# is selected (for normal use)  */
#define   SDHC_HC1R_CARDDSEL_TEST_Val         _U_(0x1)                                             /**< (SDHC_HC1R) The Card Select Test Level is selected (for test purpose)  */
#define SDHC_HC1R_CARDDSEL_NORMAL             (SDHC_HC1R_CARDDSEL_NORMAL_Val << SDHC_HC1R_CARDDSEL_Pos) /**< (SDHC_HC1R) SDCD# is selected (for normal use) Position  */
#define SDHC_HC1R_CARDDSEL_TEST               (SDHC_HC1R_CARDDSEL_TEST_Val << SDHC_HC1R_CARDDSEL_Pos) /**< (SDHC_HC1R) The Card Select Test Level is selected (for test purpose) Position  */
#define SDHC_HC1R_Msk                         _U_(0xDF)                                            /**< (SDHC_HC1R) Register Mask  */

/* EMMC mode */
#define SDHC_HC1R_EMMC_Msk                    _U_(0x00)                                             /**< (SDHC_HC1R_EMMC) Register Mask  */


