Microchip-MPLAB-Harmony/ethercat/apps/ethercat_counter_foe_app/firmware/src/packs/ATSAME53J20A_DFP/component/sdhc.h
/* -------- SDHC_EISIER : (SDHC Offset: 0x3A) (R/W 16) Error Interrupt Signal Enable -------- */
#define SDHC_EISIER_RESETVALUE                _U_(0x00)                                            /**<  (SDHC_EISIER) Error Interrupt Signal Enable  Reset Value */

#define SDHC_EISIER_CMDTEO_Pos                _U_(0)                                               /**< (SDHC_EISIER) Command Timeout Error Signal Enable Position */
#define SDHC_EISIER_CMDTEO_Msk                (_U_(0x1) << SDHC_EISIER_CMDTEO_Pos)                 /**< (SDHC_EISIER) Command Timeout Error Signal Enable Mask */
#define SDHC_EISIER_CMDTEO(value)             (SDHC_EISIER_CMDTEO_Msk & ((value) << SDHC_EISIER_CMDTEO_Pos))
#define   SDHC_EISIER_CMDTEO_MASKED_Val       _U_(0x0)                                             /**< (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_CMDTEO_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_CMDTEO_MASKED             (SDHC_EISIER_CMDTEO_MASKED_Val << SDHC_EISIER_CMDTEO_Pos) /**< (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_CMDTEO_ENABLED            (SDHC_EISIER_CMDTEO_ENABLED_Val << SDHC_EISIER_CMDTEO_Pos) /**< (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_CMDCRC_Pos                _U_(1)                                               /**< (SDHC_EISIER) Command CRC Error Signal Enable Position */
#define SDHC_EISIER_CMDCRC_Msk                (_U_(0x1) << SDHC_EISIER_CMDCRC_Pos)                 /**< (SDHC_EISIER) Command CRC Error Signal Enable Mask */
#define SDHC_EISIER_CMDCRC(value)             (SDHC_EISIER_CMDCRC_Msk & ((value) << SDHC_EISIER_CMDCRC_Pos))
#define   SDHC_EISIER_CMDCRC_MASKED_Val       _U_(0x0)                                             /**< (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_CMDCRC_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_CMDCRC_MASKED             (SDHC_EISIER_CMDCRC_MASKED_Val << SDHC_EISIER_CMDCRC_Pos) /**< (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_CMDCRC_ENABLED            (SDHC_EISIER_CMDCRC_ENABLED_Val << SDHC_EISIER_CMDCRC_Pos) /**< (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_CMDEND_Pos                _U_(2)                                               /**< (SDHC_EISIER) Command End Bit Error Signal Enable Position */
#define SDHC_EISIER_CMDEND_Msk                (_U_(0x1) << SDHC_EISIER_CMDEND_Pos)                 /**< (SDHC_EISIER) Command End Bit Error Signal Enable Mask */
#define SDHC_EISIER_CMDEND(value)             (SDHC_EISIER_CMDEND_Msk & ((value) << SDHC_EISIER_CMDEND_Pos))
#define   SDHC_EISIER_CMDEND_MASKED_Val       _U_(0x0)                                             /**< (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_CMDEND_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_CMDEND_MASKED             (SDHC_EISIER_CMDEND_MASKED_Val << SDHC_EISIER_CMDEND_Pos) /**< (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_CMDEND_ENABLED            (SDHC_EISIER_CMDEND_ENABLED_Val << SDHC_EISIER_CMDEND_Pos) /**< (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_CMDIDX_Pos                _U_(3)                                               /**< (SDHC_EISIER) Command Index Error Signal Enable Position */
#define SDHC_EISIER_CMDIDX_Msk                (_U_(0x1) << SDHC_EISIER_CMDIDX_Pos)                 /**< (SDHC_EISIER) Command Index Error Signal Enable Mask */
#define SDHC_EISIER_CMDIDX(value)             (SDHC_EISIER_CMDIDX_Msk & ((value) << SDHC_EISIER_CMDIDX_Pos))
#define   SDHC_EISIER_CMDIDX_MASKED_Val       _U_(0x0)                                             /**< (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_CMDIDX_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_CMDIDX_MASKED             (SDHC_EISIER_CMDIDX_MASKED_Val << SDHC_EISIER_CMDIDX_Pos) /**< (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_CMDIDX_ENABLED            (SDHC_EISIER_CMDIDX_ENABLED_Val << SDHC_EISIER_CMDIDX_Pos) /**< (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_DATTEO_Pos                _U_(4)                                               /**< (SDHC_EISIER) Data Timeout Error Signal Enable Position */
#define SDHC_EISIER_DATTEO_Msk                (_U_(0x1) << SDHC_EISIER_DATTEO_Pos)                 /**< (SDHC_EISIER) Data Timeout Error Signal Enable Mask */
#define SDHC_EISIER_DATTEO(value)             (SDHC_EISIER_DATTEO_Msk & ((value) << SDHC_EISIER_DATTEO_Pos))
#define   SDHC_EISIER_DATTEO_MASKED_Val       _U_(0x0)                                             /**< (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_DATTEO_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_DATTEO_MASKED             (SDHC_EISIER_DATTEO_MASKED_Val << SDHC_EISIER_DATTEO_Pos) /**< (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_DATTEO_ENABLED            (SDHC_EISIER_DATTEO_ENABLED_Val << SDHC_EISIER_DATTEO_Pos) /**< (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_DATCRC_Pos                _U_(5)                                               /**< (SDHC_EISIER) Data CRC Error Signal Enable Position */
#define SDHC_EISIER_DATCRC_Msk                (_U_(0x1) << SDHC_EISIER_DATCRC_Pos)                 /**< (SDHC_EISIER) Data CRC Error Signal Enable Mask */
#define SDHC_EISIER_DATCRC(value)             (SDHC_EISIER_DATCRC_Msk & ((value) << SDHC_EISIER_DATCRC_Pos))
#define   SDHC_EISIER_DATCRC_MASKED_Val       _U_(0x0)                                             /**< (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_DATCRC_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_DATCRC_MASKED             (SDHC_EISIER_DATCRC_MASKED_Val << SDHC_EISIER_DATCRC_Pos) /**< (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_DATCRC_ENABLED            (SDHC_EISIER_DATCRC_ENABLED_Val << SDHC_EISIER_DATCRC_Pos) /**< (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_DATEND_Pos                _U_(6)                                               /**< (SDHC_EISIER) Data End Bit Error Signal Enable Position */
#define SDHC_EISIER_DATEND_Msk                (_U_(0x1) << SDHC_EISIER_DATEND_Pos)                 /**< (SDHC_EISIER) Data End Bit Error Signal Enable Mask */
#define SDHC_EISIER_DATEND(value)             (SDHC_EISIER_DATEND_Msk & ((value) << SDHC_EISIER_DATEND_Pos))
#define   SDHC_EISIER_DATEND_MASKED_Val       _U_(0x0)                                             /**< (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_DATEND_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_DATEND_MASKED             (SDHC_EISIER_DATEND_MASKED_Val << SDHC_EISIER_DATEND_Pos) /**< (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_DATEND_ENABLED            (SDHC_EISIER_DATEND_ENABLED_Val << SDHC_EISIER_DATEND_Pos) /**< (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_CURLIM_Pos                _U_(7)                                               /**< (SDHC_EISIER) Current Limit Error Signal Enable Position */
#define SDHC_EISIER_CURLIM_Msk                (_U_(0x1) << SDHC_EISIER_CURLIM_Pos)                 /**< (SDHC_EISIER) Current Limit Error Signal Enable Mask */
#define SDHC_EISIER_CURLIM(value)             (SDHC_EISIER_CURLIM_Msk & ((value) << SDHC_EISIER_CURLIM_Pos))
#define   SDHC_EISIER_CURLIM_MASKED_Val       _U_(0x0)                                             /**< (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_CURLIM_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_CURLIM_MASKED             (SDHC_EISIER_CURLIM_MASKED_Val << SDHC_EISIER_CURLIM_Pos) /**< (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_CURLIM_ENABLED            (SDHC_EISIER_CURLIM_ENABLED_Val << SDHC_EISIER_CURLIM_Pos) /**< (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_ACMD_Pos                  _U_(8)                                               /**< (SDHC_EISIER) Auto CMD Error Signal Enable Position */
#define SDHC_EISIER_ACMD_Msk                  (_U_(0x1) << SDHC_EISIER_ACMD_Pos)                   /**< (SDHC_EISIER) Auto CMD Error Signal Enable Mask */
#define SDHC_EISIER_ACMD(value)               (SDHC_EISIER_ACMD_Msk & ((value) << SDHC_EISIER_ACMD_Pos))
#define   SDHC_EISIER_ACMD_MASKED_Val         _U_(0x0)                                             /**< (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_ACMD_ENABLED_Val        _U_(0x1)                                             /**< (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_ACMD_MASKED               (SDHC_EISIER_ACMD_MASKED_Val << SDHC_EISIER_ACMD_Pos) /**< (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_ACMD_ENABLED              (SDHC_EISIER_ACMD_ENABLED_Val << SDHC_EISIER_ACMD_Pos) /**< (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_ADMA_Pos                  _U_(9)                                               /**< (SDHC_EISIER) ADMA Error Signal Enable Position */
#define SDHC_EISIER_ADMA_Msk                  (_U_(0x1) << SDHC_EISIER_ADMA_Pos)                   /**< (SDHC_EISIER) ADMA Error Signal Enable Mask */
#define SDHC_EISIER_ADMA(value)               (SDHC_EISIER_ADMA_Msk & ((value) << SDHC_EISIER_ADMA_Pos))
#define   SDHC_EISIER_ADMA_MASKED_Val         _U_(0x0)                                             /**< (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_ADMA_ENABLED_Val        _U_(0x1)                                             /**< (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_ADMA_MASKED               (SDHC_EISIER_ADMA_MASKED_Val << SDHC_EISIER_ADMA_Pos) /**< (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_ADMA_ENABLED              (SDHC_EISIER_ADMA_ENABLED_Val << SDHC_EISIER_ADMA_Pos) /**< (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_Msk                       _U_(0x03FF)                                          /**< (SDHC_EISIER) Register Mask  */

/* EMMC mode */
#define SDHC_EISIER_EMMC_BOOTAE_Pos           _U_(12)                                              /**< (SDHC_EISIER) Boot Acknowledge Error Signal Enable Position */
#define SDHC_EISIER_EMMC_BOOTAE_Msk           (_U_(0x1) << SDHC_EISIER_EMMC_BOOTAE_Pos)            /**< (SDHC_EISIER) Boot Acknowledge Error Signal Enable Mask */
#define SDHC_EISIER_EMMC_BOOTAE(value)        (SDHC_EISIER_EMMC_BOOTAE_Msk & ((value) << SDHC_EISIER_EMMC_BOOTAE_Pos))
#define SDHC_EISIER_EMMC_Msk                  _U_(0x1000)                                           /**< (SDHC_EISIER_EMMC) Register Mask  */


/* -------- SDHC_ACESR : (SDHC Offset: 0x3C) ( R/ 16) Auto CMD Error Status -------- */
#define SDHC_ACESR_RESETVALUE                 _U_(0x00)                                            /**<  (SDHC_ACESR) Auto CMD Error Status  Reset Value */

